export const REGEX = {
    name: {
      regexr: /^[가-힣]{2,}$/,
      text: "한글문자 형식이어야 합니다."
     },
    username: {
      regexr: /^[A-Za-z0-9]{5,15}$/,
      text: "영문자, 숫자 5 ~ 15자리 형식이어야 합니다."
    },
    password: {
      regexr: /^(?=.*[A-Za-z])(?=.*\d)(?=.*[@$!%*#?&])[A-Za-z\d@$!%*#?&]{7,128}$/,
      text: "하나의 영문자, 숫자, 특수문자를 포함한 5~128자리 형식이어야 합니다."
     },
     nickname: {
      regexr: /^[가-힣A-Za-z0-9]{1,10}$/,
      text: "공백 또는 특수문자가 포함되었습니다."
     },
     email: {
      regexr: /^[0-9a-zA-Z]([-_\.]?[0-9a-zA-Z])*@[0-9a-zA-Z]([-_\.]?[0-9a-zA-Z])*\.[a-zA-Z]{1,3}$/,
      text: "이메일 형식이어야 합니다."
     },
     birthDate: {
      regexr: /^(19[0-9][0-9]|20\d{2})(0[0-9]|1[0-2])(0[1-9]|[1-2][0-9]|3[0-1])$/,
      text: " - 없이 8자리 입력해주세요. 예) 20010707"
     },
     phoneNumber: {
      regexr: /^01(?:0|1|[6-9])(?:\d{3}|\d{4})\d{5}$/,
      text: " - 없이 11자리 입력해주세요. 예) 01012345678"
     }
};